In [2]:
import numpy as np, pandas as pd, matplotlib.pyplot as plt
from sklearn import linear_model

In [3]:
df = pd.read_csv('hiring.csv')
df.columns = ['exp', 'test_score', 'int_score', 'salary']
df

      exp  test_score  int_score  salary
0     NaN         8.0          9   50000
1     NaN         8.0          6   45000
2    five         6.0          7   60000
3     two        10.0         10   65000
4   seven         9.0          6   70000
5   three         7.0         10   62000
6     ten         NaN          7   72000
7  eleven         7.0          8   80000

In [4]:
word_to_num = {
    "one": 1, "two": 2, "three": 3, "four": 4, "five": 5,
    "six": 6, "seven": 7, "eight": 8, "nine": 9, "ten": 10,
    "eleven": 11
}
df["exp"] = df["exp"].replace(word_to_num).astype(float)
df

    exp  test_score  int_score  salary
0   NaN         8.0          9   50000
1   NaN         8.0          6   45000
2   5.0         6.0          7   60000
3   2.0        10.0         10   65000
4   7.0         9.0          6   70000
5   3.0         7.0         10   62000
6  10.0         NaN          7   72000
7  11.0         7.0          8   80000

In [5]:
df.exp.dtype, df.exp.median(skipna=True)

(dtype('float64'), 6.0)

In [6]:
# handle unwanted NaN values by putting in the median
df['exp'].fillna(df.exp.median(skipna=True), inplace=True)
df['test_score'].fillna(df['test_score'].median(skipna=True), inplace=True)
df

    exp  test_score  int_score  salary
0   6.0         8.0          9   50000
1   6.0         8.0          6   45000
2   5.0         6.0          7   60000
3   2.0        10.0         10   65000
4   7.0         9.0          6   70000
5   3.0         7.0         10   62000
6  10.0         8.0          7   72000
7  11.0         7.0          8   80000

In [ ]:
test_data = df[-2:]
copy_df = df.copy()

#copy_df is df

model = linear_model.LinearRegression()
model.fit(copy_df[['exp', 'test_score', 'int_score']], copy_df['salary'])

(    exp  test_score  int_score  salary
 0   6.0         8.0          9   50000
 1   6.0         8.0          6   45000
 2   5.0         6.0          7   60000
 3   2.0        10.0         10   65000
 4   7.0         9.0          6   70000
 5   3.0         7.0         10   62000
 6  10.0         8.0          7   72000
 7  11.0         7.0          8   80000,
     exp  test_score  int_score  salary
 0   6.0         8.0          9   50000
 1   6.0         8.0          6   45000
 2   5.0         6.0          7   60000
 3   2.0        10.0         10   65000
 4   7.0         9.0          6   70000
 5   3.0         7.0         10   62000
 6  10.0         8.0          7   72000
 7  11.0         7.0          8   80000,
     exp  test_score  int_score  salary
 0  True        True       True    True
 1  True        True       True    True
 2  True        True       True    True
 3  True        True       True    True
 4  True        True       True    True
 5  True        True       True    True
 6  True        True       True    True
 7  True        True       True    True)

In [8]:
model.predict(np.array(test_data[['exp', 'test_score', 'int_score']]))

/usr/lib/python3/dist-packages/sklearn/base.py:493: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([71154.47154472, 75560.97560976])